app/controllers/mcqquestions_controller.rb

SELECT  "mcqquestions".* FROM "mcqquestions" WHERE "mcqquestions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@mcqquestion = Mcqquestion.find(params[:id])

SELECT "mcqquestions".* FROM "mcqquestions"
---
	def index
		@mcqquestion = Mcqquestion.all

SELECT  "mcqquestions".* FROM "mcqquestions" WHERE "mcqquestions"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
	def show
		@mcqquestion = Mcqquestion.find(params[:id])

SELECT  "mcqquestions".* FROM "mcqquestions" WHERE "mcqquestions"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
	def a
		@mcqquestion = Mcqquestion.find(params[:id])

INSERT INTO "mcqquestions" ("Question", "Option_A", "Option_B", "Option_c", "Option_D", "Correct_Option", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
  		@mcqquestion = Mcqquestion.new(mcqquestion_params)
  		if @mcqquestion.save

SELECT  "mcqquestions".* FROM "mcqquestions" WHERE "mcqquestions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "mcqquestions" SET "Correct_Option" = ?, "updated_at" = ? WHERE "mcqquestions"."id" = ?  [["Correct_Option", "A"], ["updated_at", "2019-06-18 12:49:52.853663"], ["id", 2]]
---
	def update
		@mcqquestion = Mcqquestion.find(params[:id])
		if @mcqquestion.update(mcqquestion_params)

SELECT  "mcqquestions".* FROM "mcqquestions" WHERE "mcqquestions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "mcqquestions" WHERE "mcqquestions"."id" = ?  [["id", 2]]
---
	def destroy
    @mcqquestion = Mcqquestion.find(params[:id])
    @mcqquestion.destroy