app/controllers/tests_controller.rb

SELECT  "mcqquestions".* FROM "mcqquestions" WHERE "mcqquestions"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
	def new
		@mcqquestion = Mcqquestion.find_by_id(params[:id])

SELECT  "mcqquestions".* FROM "mcqquestions" WHERE "mcqquestions"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
	def show
		@mcqquestion = Mcqquestion.find(params[:id])

SELECT  "mcqquestions".* FROM "mcqquestions" WHERE "mcqquestions"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
	def create
		@mcqquestion = Mcqquestion.find_by_id(params[:id])